# Studio: Working with Databases in Python

For today's studio, we will be using the [TV Shows dataset](https://www.kaggle.com/ruchi798/tv-shows-on-netflix-prime-video-hulu-and-disney) from Kaggle. We have already downloaded the CSV for you.

You will also be using the watchlist you just created to figure out which streaming services contain the shows that you want to watch next so you can decide which one is worth the money to you.

As you complete the different tasks in the studio, you may choose between using Pandas or SQL. Remember that during the prep work, we learned that one is oftentimes more efficient at certain tasks than the other, so choose wisely!

## My Watchlist

If you would like, please use this space to make note of your watchlist by editing the text cell.

  

The Marvelous Mrs. Maisel

Only Murders in the Building

Yellowjackets

Jury Duty

Black Mirror

No Hard Feelings

Don’t Worry Darling

The Menu

Love Again

A Small Light

## Database Setup

To start with, import the necessary libraries and create a dataframe from the provided CSV. Print the info out for the dataframe. After that, you may drop the column called `Unnamed: 0` and rename any columns with spaces in the names or unusual characters such as `"+"`. Print out the info for the dataframe again to ensure that your changes were effective.

In [2]:
import pandas as pd
import sqlite3 as sl
data = pd.read_csv('tv_shows.csv')
df = pd.DataFrame(data)
df.rename(columns = {'Disney+':'DisneyPlus', 'Rotten Tomatoes':'RottenTomatoes', 'Prime Video': 'PrimeVideo', 'IMDb': 'IMDB'}, inplace = True)
df = df.drop(['Unnamed: 0'], axis = 1)
df.head()

,ID,Title,Year,Age,IMDB,RottenTomatoes,Netflix,Hulu,PrimeVideo,DisneyPlus,Type
0,1,Breaking Bad,2008,18+,9.4/10,100/100,1,0,0,0,1
1,2,Stranger Things,2016,16+,8.7/10,96/100,1,0,0,0,1
2,3,Attack on Titan,2013,18+,9.0/10,95/100,1,1,0,0,1
3,4,Better Call Saul,2015,18+,8.8/10,94/100,1,0,0,0,1
4,5,Dark,2017,16+,8.8/10,93/100,1,0,0,0,1

With your dataframe at the ready, create a new database called `tv`. Add a new table to your database called `shows` using the data in the dataframe.

In [4]:
conn = sl.connect('tv.db')
df.to_sql(name='shows', con= conn, if_exists = 'replace')

5368

With your new table and database set up, print out the top 20 records in the `shows` table.

In [7]:
data = pd.read_sql_query("SELECT * FROM shows", conn)
data.head()

,index,ID,Title,Year,Age,IMDB,RottenTomatoes,Netflix,Hulu,PrimeVideo,DisneyPlus,Type
0,0,1,Breaking Bad,2008,18+,9.4/10,100/100,1,0,0,0,1
1,1,2,Stranger Things,2016,16+,8.7/10,96/100,1,0,0,0,1
2,2,3,Attack on Titan,2013,18+,9.0/10,95/100,1,1,0,0,1
3,3,4,Better Call Saul,2015,18+,8.8/10,94/100,1,0,0,0,1
4,4,5,Dark,2017,16+,8.8/10,93/100,1,0,0,0,1

Now add a table that includes an id number and the titles on your watchlist.

In [8]:
with conn:
    conn.execute("""
    DROP TABLE IF EXISTS guess;""")
    
with conn:
    conn.execute("""CREATE TABLE watchlist(
                ID INTEGER,
                Title TEXT
                );
    """)

In [12]:
sql = 'INSERT INTO watchlist (ID, Title) values(?,?)'
data = [
    (1, 'The Marvelous Mrs. Maisel'),

    (2,'Only Murders in the Building'),

    (3, 'Yellowjackets'),

    (4, 'Jury Duty'),

    (5,'Black Mirror'),

    (6,'No Hard Feelings'),

    (7, 'Don’t Worry Darling'),

    (8, 'The Menu'),

    (9, 'Love Again'),

    (10, 'A Small Light'),

]

conn.executemany(sql, data)

In [14]:
data = pd.read_sql_query("SELECT * FROM watchlist", conn)
data.head(10)

   ID                         Title
0   1     The Marvelous Mrs. Maisel
1   2  Only Murders in the Building
2   3                 Yellowjackets
3   4                     Jury Duty
4   5                  Black Mirror
5   6              No Hard Feelings
6   7           Don’t Worry Darling
7   8                      The Menu
8   9                    Love Again
9  10                 A Small Light

## Working with the Data

Using either Pandas or SQL, determine how many shows are on each streaming service and what the mean is for each streaming service. 

**Note**: You may notice that the mean represents the percentage of shows in the dataframe that are on each streaming service. Take a moment to think about why that is.

In [36]:
netflix_dict = {"Netflix":["sum", "mean"]}
netflix_dictionary = df.agg(netflix_dict)
netflix_dictionary

      Netflix
sum       0.0
mean      0.0

In [37]:
hulu_dict = {"Hulu":["sum", "mean"]}
hulu_dictionary = df.agg(hulu_dict)
hulu_dictionary

             Hulu
sum   1621.000000
mean     0.301975

In [38]:
prime_dict = {"PrimeVideo":["sum", "mean"]}
prime_dictionary = df.agg(prime_dict)
prime_dictionary

       PrimeVideo
sum   1831.000000
mean     0.341095

In [39]:
disney_dict = {"DisneyPlus":["sum", "mean"]}
disney_dictionary = df.agg(disney_dict)
disney_dictionary

      DisneyPlus
sum   351.000000
mean    0.065387

Join your watchlist data with the shows data to determine which streaming services your watchlist shows are on and make a new table in your database using the joined data. Print out the data in your joined table to see what shows on your watchlist on in the original dataset. With the joined data, determine the percentage of your watchlist shows that are on each streaming service and how many of your watchlist shows are on each streaming service.

In [17]:
data = pd.read_sql_query("""
        SELECT *
        FROM shows
        INNER JOIN watchlist on shows.Title = watchlist.Title""", conn)
data.head(10)

,index,ID,Title,Year,Age,IMDB,RottenTomatoes,Netflix,Hulu,PrimeVideo,DisneyPlus,Type,ID,Title
0,8,9,Black Mirror,2011,18+,8.8/10,92/100,1,0,0,0,1,5,Black Mirror
1,3456,3597,The Marvelous Mrs. Maisel,2017,18+,8.7/10,86/100,0,0,1,0,1,1,The Marvelous Mrs. Maisel

## Results

Now that you have done your analysis, make note of the answers to the following questions by editing the text cell:

1. Was every show on your watchlist in the Kaggle dataset? Do you have any ideas as to why a show might not have been present? No, only two of my shows. This might be becuase they are recent releases or on different platforms.
2. Did you include a show or shows in your watchlist that is exclusive to one of the platforms? How might that have impacted your analysis? My shows were either on Netflix, Hulu, or Prime. I did not have nay on DisneyPlus.
2. Which streaming service(s) offered the most shows on your watchlist? Which streaming service(s) offered the least? Both of the shows were only offerend on one platform.
3. Based on the shows you want to watch and the results of your analysis, is there a streaming service you think would be a good fit for you? Not based on this analysis becuase each show was only on one platform.